In [1]:
import numpy as np
import pandas as pd

In [2]:
s=pd.Series(['a',np.nan,1,np.nan,2])
s.isnull().sum()

2

In [3]:
# Data Frame 
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve", "Alice"],
    "Age": [25, 30, 35, np.nan, 29, 25],
    "Department": ["HR", "IT", "Finance", "IT", "HR", "HR"],
    "Salary": [50000, 60000, 70000, 62000, np.nan, 50000]
}
df = pd.DataFrame(data)
df

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [4]:
df.head()

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN

In [5]:
df.iloc[0:4]

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0

In [6]:
 # In this example we want only 3 rows and only two columns. Hece we have used Index and columns name 
df.loc[0:2,['Name','Salary']]

      Name   Salary
0    Alice  50000.0
1      Bob  60000.0
2  Charlie  70000.0

In [10]:
#Here iloc function gives the output as row as index and columns based on given index
df.iloc[0:2, :2]

    Name   Age
0  Alice  25.0
1    Bob  30.0

In [11]:
# if we want one columns 
df['Age']

0    25.0
1    30.0
2    35.0
3     NaN
4    29.0
5    25.0
Name: Age, dtype: float64

In [12]:
# if we want multiple columns 
df[['Age','Name']]

    Age     Name
0  25.0    Alice
1  30.0      Bob
2  35.0  Charlie
3   NaN    David
4  29.0      Eve
5  25.0    Alice

In [13]:
df.isnull().sum()

Name          0
Age           1
Department    0
Salary        1
dtype: int64

In [14]:
df1=df.drop('Age',axis=1)

In [15]:
df1

      Name Department   Salary
0    Alice         HR  50000.0
1      Bob         IT  60000.0
2  Charlie    Finance  70000.0
3    David         IT  62000.0
4      Eve         HR      NaN
5    Alice         HR  50000.0

In [16]:
df

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [18]:
df.shape

(6, 4)

In [20]:
# This gives the information about the data 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        6 non-null      object
 1   Age         5 non-null      float64
 2   Department  6 non-null      object
 3   Salary      5 non-null      float64
dtypes: float64(2), object(2)
memory usage: 320.0+ bytes

In [21]:
# This gives the statistical information about the data

In [22]:
df.describe()

             Age        Salary
count   5.000000      5.000000
mean   28.800000  58400.000000
std     4.147288   8532.291603
min    25.000000  50000.000000
25%    25.000000  50000.000000
50%    29.000000  60000.000000
75%    30.000000  62000.000000
max    35.000000  70000.000000